KinDinnerParty.Def = {
	tbTaskMailAttaches = {	--每周布置任务邮件附件
		{"Coin", 1000},
	},

	nNpcFurnitureId = 10026,	-- 餐桌同等大小家具，检测是否可以摆放餐桌用

	nMinTaskLevel = 50,	--领取任务最小等级（含）

	nTaskCount = 9,	--任务条数
	HELP_IMITITY = 30; --帮忙装货增加亲密度
	tbWildMap = {10, 1000, 1405, 403, 409};	--采集地图id
	szIconAtlas = "UI/Atlas/Item/Item/Item16.prefab",	--任务界面物品图片atlas

	nMaxWeeklyCount = 2,	--家族每周最多聚餐次数
	nMaxPlayerJoinCount = 2,	--玩家每周最多参与次数

	nPartyTokenId = 9478,	--聚餐令牌道具id
	nTableNpcId = 3204,	--餐桌npc
	nTokenExpireTime = 7 * 24 * 3600,	--聚餐令牌有效期（秒）

	nAddExpInterval = 15,	--多少秒加一次经验
	nAddExpBase = 1.25,	--每次加多少倍的基础经验
	nBuffId = 4906,	--buff id

	tbEatRewards = {{"item", 9494, 1}},	--吃菜奖励

	tbTimers = {	--定时器，可执行的指令：start, food(上菜), stopwarning, guess(新一轮猜成语), stop
		{2* 60, {"start", "food", "guess"}},
		{4* 60, {"food", "guess"}},
		{6* 60, {"food", "guess"}},
		{8* 60, {"food", "guess", "stopwarning"}},
		{10 * 60, {"stop"}},
	},

	nMaxGuessLen = 4,	--输入成语最大长度
	tbIdioms = {	--成语
		"海阔天空",
		"情非得已",
		"满腹经纶",
		"兵临城下",
		"春暖花开",
		"插翅难逃",
		"黄道吉日",
		"天下无双",
		"偷天换日",
		"两小无猜",
		"卧虎藏龙",
		"珠光宝气",
		"簪缨世族",
		"绘声绘影",
		"国色天香",
		"相亲相爱",
		"八仙过海",
		"金玉良缘",
		"掌上明珠",
		"皆大欢喜",
		"逍遥法外",
		"生财有道",
		"极乐世界",
		"情不自禁",
		"愚公移山",
		"魑魅魍魉",
		"龙生九子",
		"精卫填海",
		"海市蜃楼",
		"高山流水",
		"卧薪嚐胆",
		"壮志凌云",
		"金枝玉叶",
		"四海一家",
		"穿针引线",
		"无忧无虑",
		"无地自容",
		"三位一体",
		"落叶归根",
		"相见恨晚",
		"惊天动地",
		"滔滔不绝",
		"相濡以沫",
		"长生不死",
		"原来如此",
		"女娲补天",
		"三皇五帝",
		"万箭穿心",
		"水木清华",
		"窈窕淑女",
		"破釜沉舟",
		"天涯海角",
		"牛郎织女",
		"倾国倾城",
		"飘飘欲仙",
		"福星高照",
		"妄自菲薄",
		"永无止境",
		"学富五车",
		"饮食男女",
		"英雄豪杰",
		"国士无双",
		"塞翁失马",
		"万家灯火",
		"石破天惊",
		"精忠报国",
		"养生之道",
		"覆雨翻云",
		"六道轮回",
		"鹰击长空",
		"日日夜夜",
		"厚德载物",
		"亡羊补牢",
		"万里长城",
		"黄金时代",
		"出生入死",
		"一路顺风",
		"随遇而安",
		"千军万马",
		"郑人买履",
		"待字闺中",
		"女扮男装",
		"东张西望",
		"马首是瞻",
		"物极必反",
		"蔚然成风",
		"迫不及待",
		"淋漓尽致",
		"风尘仆仆",
		"外强中乾",
		"求全责备",
		"人浮於事",
		"安居乐业",
		"珠联璧合",
		"一网打尽",
		"任重道远",
		"循循善诱",
		"移花接木",
		"不知所措",
		"柳暗花明",
		"白虹贯日",
		"首鼠两端",
		"前仆後继",
		"醉生梦死",
		"惺惺相惜",
		"焚膏继晷",
		"金童玉女",
		"横扫千军",
		"闭门造车",
	},


	--
	-- 以下由程序配置
	--
	nSaveGroup = 172,
	nKeyWeekJoinTime = 1,
	nKeyJoinCount = 2,
}

if not version_tx and not version_hk then
	KinDinnerParty.bForceClose = true
end